Revit 2024 API
Grid.SetVerticalExtents Method
 Adjusts the grid to extend through only the vertical range between bottom and top.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void SetVerticalExtents(
	double bottom,
	double top
)
Visual Basic
Public Sub SetVerticalExtents ( _
	bottom As Double, _
	top As Double _
)
Visual C++
public:
void SetVerticalExtents(
	double bottom,
	double top
)
Parameters
bottom
Type: System.Double
 The bottom range of the grid extents. It must be a valid number and below the top range.
top
Type: System.Double
 The top range of the grid extents. It must be a valid number and above the bottom range.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The bottom and top ranges are reversed for the extents.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for bottom must be no more than 30000 feet in absolute value. -or- The given value for top must be no more than 30000 feet in absolute value.
Autodesk.Revit.Exceptions.InvalidOperationException |  Couldn't change the extents of the grid.
See Also
Grid Class
Autodesk.Revit.DB Namespace